# Dotfiles Brewfile
# Install with: brew bundle

# Essential CLI Tools
# -------------------

# Search & Navigation
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Better grep
brew "fd"           # Better find
brew "zoxide"       # Smart cd

# Modern Replacements
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Better ls with icons & git status
brew "tldr"         # Simplified man pages

# Dev Tools
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "httpie"       # User-friendly HTTP client
brew "gh"           # GitHub CLI
brew "vercel-cli"   # Vercel CLI

# System Utils
brew "htop"         # Process viewer
brew "tree"         # Directory visualization

# Version Management
brew "nvm"          # Node version manager
brew "uv"           # Fast Python package installer & version manager

# Git & Security
brew "gpg"          # GPG for commit signing
brew "git"          # Git (latest version)

# AI Tools
cask "codex"        # OpenAI Codex CLI
cask "claude"       # Anthropic Claude desktop
cask "cursor"       # Cursor IDE (includes CLI)

# Cloud & Infrastructure
brew "awscli"       # AWS CLI v2
brew "azure-cli"    # Azure CLI
cask "gcloud-cli"   # GCP CLI (gcloud)
brew "tfenv"        # Terraform version manager
brew "opentofu"     # Infrastructure as Code

# Kubernetes & Containers
brew "colima"       # Container runtime (Docker alternative)
brew "docker"       # Docker CLI
brew "kubernetes-cli" # kubectl
brew "helm"         # Kubernetes package manager
brew "eksctl"       # EKS cluster management
brew "kompose"      # Docker Compose to K8s
brew "k9s"          # Kubernetes TUI
brew "act"          # Local GitHub Actions runner

# Security Scanning
brew "terrascan"    # IaC security scanner

# Languages
brew "go"           # Go programming language
brew "pyenv"        # Python version manager

# Go Tooling
brew "golangci-lint"  # Go linter aggregator
brew "air"            # Go hot reload

# Python Tooling
brew "ruff"           # Fast Python linter & formatter

# Node/React
brew "pnpm"           # Fast package manager

# Stacking PRs
tap "withgraphite/tap"
brew "withgraphite/tap/graphite"  # gt - stacked PRs

# Linear
tap "schpet/tap"
brew "schpet/tap/linear"          # Linear CLI

# Productivity
brew "tmux"       # Terminal multiplexer
brew "trash"      # Safe delete CLI
cask "iterm2"     # Terminal emulator

# Optional: Media tools (used by video-transcript-downloader)
brew "yt-dlp"
brew "ffmpeg"
